Intelligent_Data_Design/Assignments/lec16/lec16.tex
% Created 2023-03-02 Thu 15:19
% Intended LaTeX compiler: lualatex
\documentclass[11pt]{article}
\usepackage[margin=0.5in]{geometry}
\usepackage{syntax}
\usepackage{pdfpages}
\usepackage{tcolorbox}
\usepackage{etoolbox}
\usepackage[ruled]{algorithm2e}
\BeforeBeginEnvironment{minted}{\begin{tcolorbox}}%
\AfterEndEnvironment{minted}{\end{tcolorbox}}%
\BeforeBeginEnvironment{verbatim}{\begin{tcolorbox}}%
\AfterEndEnvironment{verbatim}{\end{tcolorbox}}%
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{physics}
\author{David Lewis}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={David Lewis},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\section*{1.}
\label{sec:org37af849}
\begin{equation}


\begin{align}
\(K(x_i, x_j) = \phi(x_i) \cdot \phi(x_j) &= x_i \cdot x_j + (x_i\cdot x_j)^2 \\ & = a_ia_j+b_ib_j + a_i^2a_j^2 + b_i^2b_j^2 + 2a_ib_ia_jb_j \)
\end{align}
\end{equation}

\begin{equation}
\(\phi(x) = a, b, a^2, b^2, \sqrt{2}ab\)
\end{equation}

\section*{2.}
\label{sec:org8fe70d9}
\subsection*{a.}
\label{sec:orgcb8a7b7}
\begin{verbatim}
 colour != Red and colour != yellow -> Don't buy
 colour != Red and colour == yellow and make !=  ferrari -> Don't buy
 colour != Red and colour == yellow and make =  ferrari -> buy
 colour != Red and colour == yellow and make =  ferrari -> buy
 colour == Red and Model > 2010 -> Buy
 colour == Red and Model < 2010 and Mileage < 50000KM -> buy
 colour == Red and Model < 2010 and Mileage > 50000KM -> Don't buy
\end{verbatim}

\subsection*{b.}
\label{sec:orgd86b45f}
Decision trees are not always the ideal classifier, they work by drawing ``boxes''
around particular regions, but none of the boxes can overlap. Distributions are
often not ``box'' shaped, so the drawing method of descisions trees are not ideal
for these distributions.
\section*{3.}
\label{sec:orgfc9d65f}
\subsection*{a.}
\label{sec:org5fedcd5}
(X(5), Y(6), Z(5), XY(4), XZ(2), XC(3), YZ(3), ZC(2), YC(6)  XYZ(1), XYC(3),
YZC(2), XYZC(1))

\subsection*{b.}
\label{sec:orge3f8222}
\((X, Y, Z, XY, YZ, XC, YC, XYC\))

\subsection*{c.}
\label{sec:org62a49dc}
(XYC, XC, YC)

\subsection*{d.}
\label{sec:orge61c609}
conf (XY-> C) = P(C|XY) = support(XYC)/support(XY) = 3/4
conf (Y-> C) = P(C|Y) = support(YC)/support(Y) = 4/6
conf (X-> C) = P(C|X) = support(XC)/support(X) = 3/5
(Z\textsubscript{1} \(\to\) C\textsubscript{0}) is implied here as the same as (XY \(\to\) C)
\subsection*{e.}
\label{sec:org52e34e6}
conf (XY-> C) = P(C|XY) = support(XYC)/support(XY) = 3/4
conf (Y-> C) = P(C|Y) = support(YC)/support(Y) = 4/6
conf (X-> C) = P(C|X) = support(XC)/support(X) = 3/5
\subsection*{f.}
\label{sec:org4dc7848}
1 (3/4 confidence)
\subsection*{g.}
\label{sec:org822eb61}
There is no rule, so you cannot classify it accurately (with rules). This is a
failing of the minimum support requirement. The itemsets that have a class of 0
do tend to include more zeros, so I would learn towards classifing (0,0,0) as
class 0.
\section*{4.}
\label{sec:org97deed3}
\begin{enumerate}
\item 4, the margin is maximized without caring much about the number of slack
terms (C is close to zero)
\item 3, the margin is maximized while reducing the number of slack terms (fewer
support vectors)
\item 2, kernel is quadradic shape (u shape)
\item 6, variance is smaller and 6's data points are closer together
\item 1, variance is larger and 1's data points are farther apart (circle is bigger)
\end{enumerate}
\end{document}
